dependencies/OpenFOAM/tutorials/multiphase/potentialFreeSurfaceFoam/oscillatingBox/Allrun
#!/bin/sh
cd "${0%/*}" || exit                                # Run from this directory
. ${WM_PROJECT_DIR:?}/bin/tools/RunFunctions        # Tutorial run functions
#------------------------------------------------------------------------------

runApplication blockMesh

runApplication topoSet

runApplication subsetMesh -overwrite c0 -patch floatingObject

restore0Dir

runApplication $(getApplication)

# Require awk
command -v awk >/dev/null && {
    awk '{print $1 " " $3}' \
        postProcessing/poolHeight/0/surfaceFieldValue.dat > poolHeight_vs_time
}

#------------------------------------------------------------------------------
